
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дерево = РеквизитФормыВЗначение("ДеревоМетаданных");
	
	Если Метаданные.Справочники.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Справочники";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.Справочник;
		Для Каждого Объект Из Метаданные.Справочники Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.ПланыВидовХарактеристик.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Планы видов характеристик";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.ПланВидовХарактеристик;
		Для Каждого Объект Из Метаданные.ПланыВидовХарактеристик Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.ПланыВидовРасчета.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Планы видов расчета";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.ПланВидовРасчета;
		Для Каждого Объект Из Метаданные.ПланыВидовРасчета Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.ПланыОбмена.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Планы обмена";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.ПланОбмена;
		Для Каждого Объект Из Метаданные.ПланыОбмена Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Документы.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Документы";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.Документ;
		Для Каждого Объект Из Метаданные.Документы Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.БизнесПроцессы.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Бизнес-процессы";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.БизнесПроцесс;
		Для Каждого Объект Из Метаданные.БизнесПроцессы Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.Задачи.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Задачи";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.Задача;
		Для Каждого Объект Из Метаданные.Задачи Цикл
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.Количество() > 0 Тогда 
		СтрокаГруппа = Дерево.Строки.Добавить();
		СтрокаГруппа.Имя = "";
		СтрокаГруппа.Синоним = "Регистры сведений";
		СтрокаГруппа.Картинка = БиблиотекаКартинок.РегистрСведений;
		Для Каждого Объект Из Метаданные.РегистрыСведений Цикл
			Если Объект.РежимЗаписи <> Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый 
					//ИЛИ Объект.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический 
					Тогда
				Продолжить;
			КонецЕсли; 
			НоваяСтрока = СтрокаГруппа.Строки.Добавить();
			НоваяСтрока.Тип = СтрокаГруппа.Синоним;
			НоваяСтрока.Имя = Объект.ПолноеИмя();
			Если Объект.Синоним = "" Тогда
				НоваяСтрока.Синоним = Объект.Имя;
			Иначе
				НоваяСтрока.Синоним = Объект.Синоним + " (" + Объект.Имя + ")";
			КонецЕсли; 
			НоваяСтрока.Картинка = СтрокаГруппа.Картинка;
			НоваяСтрокаТаблицы = ТаблицаМетаданных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, НоваяСтрока);
		КонецЦикла;	
		Если СтрокаГруппа.Строки.Количество() = 0 Тогда 
			Дерево.Строки.Удалить(СтрокаГруппа);
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоМетаданных");
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда 
		Для Каждого СтрокаГруппа Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
			Для Каждого Строка Из СтрокаГруппа.ПолучитьЭлементы() Цикл
				Если Строка.Имя = Параметры.ТекущаяСтрока Тогда 
					Элементы.ДеревоМетаданных.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		НайденнаяСтрока = ТаблицаМетаданных.НайтиСтроки(Новый Структура("Имя", Параметры.ТекущаяСтрока));
		Элементы.ТаблицаМетаданных.ТекущаяСтрока = НайденнаяСтрока[0].ПолучитьИдентификатор();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Строки = ДеревоМетаданных.ПолучитьЭлементы();
	Для Каждого Строка Из Строки Цикл 
		Элементы.ДеревоМетаданных.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаДеревоМетаданных Тогда
		ТекущиеДанные = Элементы.ДеревоМетаданных.ТекущиеДанные;
	Иначе                  
		ТекущиеДанные = Элементы.ТаблицаМетаданных.ТекущиеДанные;
	КонецЕсли;  //  
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	Если ТекущиеДанные.Имя = "" Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Имя",  	  ТекущиеДанные.Имя);
	Результат.Вставить("Синоним", ТекущиеДанные.Синоним);
	Результат.Вставить("Тип", ТекущиеДанные.Тип);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьИЗакрыть();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры
